<a href="https://colab.research.google.com/github/Davholl/Data-Science/blob/master/Sele%C3%A7%C3%B5es_e_Frequ%C3%AAncias.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Relatório de Análise IV

## Seleção e Frequências

In [0]:
import pandas as pd

In [0]:
dados = pd.read_csv('aluguel.csv', sep=';')

In [0]:
dados.head(10)

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0
1,Casa,Jardim Botânico,2,0,1,100,7000.0,NaN,NaN
2,Conjunto Comercial/Sala,Barra da Tijuca,0,4,0,150,5200.0,4020.0,1111.0
3,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0
4,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,NaN
5,Apartamento,Vista Alegre,3,1,0,70,1200.0,NaN,NaN
6,Apartamento,Cachambi,2,0,0,50,1300.0,301.0,17.0
7,Casa de Condomínio,Barra da Tijuca,5,4,5,750,22000.0,NaN,NaN
8,Casa de Condomínio,Ramos,2,2,0,65,1000.0,NaN,NaN
9,Conjunto Comercial/Sala,Centro,0,3,0,695,35000.0,19193.0,3030.0

In [0]:
#Selecione somente os imóveis classificados com tipo 'Apartamento'.

In [0]:
selecao = dados[(dados.Tipo == 'Apartamento')]

In [0]:
selecao.shape[0]

19532

In [0]:
#Selecione os imóveis classificados com tipos 'Casa', 'Casa de Condomínio' e 'Casa de Vila'.

In [0]:
selecao1 = dados[(dados.Tipo == 'Casa') | (dados.Tipo == 'Casa de Condomínio') | (dados.Tipo == 'Casa de Vila')]

In [0]:
selecao1.shape[0]

2212

In [0]:
#Selecione os imóveis com área entre 60 e 100 metros quadrados, incluindo os limites.

In [0]:
selecao2 = dados[(dados.Area >= 60) & (dados.Area <= 100)]

In [0]:
selecao2.shape[0]

10187

In [0]:
#Selecione os imóveis que tenham pelo menos 4 quartos e aluguel menor que R$ 2.000,00.

In [0]:
selecao3 = dados[(dados.Quartos >= 4) & (dados.Valor <= 2000)]

In [0]:
selecao3.shape[0]

62

In [0]:
import pandas as pd
alunos = pd.DataFrame({'Nome': ['Ary', 'Cátia', 'Denis', 'Beto', 'Bruna', 'Dara', 'Carlos', 'Alice'], 
                        'Sexo': ['M', 'F', 'M', 'M', 'F', 'F', 'M', 'F'], 
                        'Idade': [15, 27, 56, 32, 42, 21, 19, 35], 
                        'Notas': [7.5, 2.5, 5.0, 10, 8.2, 7, 6, 5.6], 
                        'Aprovado': [True, False, False, True, True, True, False, False]}, 
                        columns = ['Nome', 'Idade', 'Sexo', 'Notas', 'Aprovado'])

In [0]:
alunos

     Nome  Idade Sexo  Notas  Aprovado
0     Ary     15    M    7.5      True
1   Cátia     27    F    2.5     False
2   Denis     56    M    5.0     False
3    Beto     32    M   10.0      True
4   Bruna     42    F    8.2      True
5    Dara     21    F    7.0      True
6  Carlos     19    M    6.0     False
7   Alice     35    F    5.6     False

In [0]:
aprovados = alunos[(alunos.Aprovado)]

In [0]:
aprovados

    Nome  Idade Sexo  Notas  Aprovado
0    Ary     15    M    7.5      True
3   Beto     32    M   10.0      True
4  Bruna     42    F    8.2      True
5   Dara     21    F    7.0      True

In [0]:
aprovadas = aprovados[aprovados.Sexo == 'F']

In [0]:
aprovadas

    Nome  Idade Sexo  Notas  Aprovado
4  Bruna     42    F    8.2      True
5   Dara     21    F    7.0      True

In [0]:
idadeCorreta = alunos[((alunos.Idade >= 10)&(alunos.Idade <= 20)) | (alunos.Idade >= 40)]

In [0]:
idadeCorreta

     Nome  Idade Sexo  Notas  Aprovado
0     Ary     15    M    7.5      True
2   Denis     56    M    5.0     False
4   Bruna     42    F    8.2      True
6  Carlos     19    M    6.0     False

In [0]:
reprovados = alunos[(alunos.Aprovado == False)]

In [0]:
reprovados = reprovados[['Nome', 'Sexo', 'Idade']]

In [0]:
reprovados

     Nome Sexo  Idade
1   Cátia    F     27
2   Denis    M     56
6  Carlos    M     19
7   Alice    F     35